api/repositories/PostRepository.php

INSERT INTO "post" ("title", "description", "file", "created_at", "status", "user_id") VALUES ('test', 'testDescr', NULL, 1736420474, 1, NULL) RETURNING "id"
---
    public function save(Post $post): void
    {
        try {
            $post->save();