api/controllers/AuthController.php

    public function actionLogin()
    {
        $form = new LoginForm();
        $form->setAttributes(Yii::$app->request->post());
        $body = Yii::$app->request->post();

        $user = User::findOne(['email' => $body['email']]);
---
SELECT * FROM "user" WHERE "email"='testuser@example.com'