api/models/User.php

    public static function findIdentity($id)
    {
        return static::findOne($id);
---
SELECT * FROM "user" WHERE "id"=1

    public static function findIdentityByAccessToken($token, $type = null)
    {

        $jwt = Yii::$app->jwt;
        try {
            $data = $jwt->decode($token);
            return static::findOne($data['user_id']);
---
SELECT * FROM "user" WHERE "id"=1